In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
list('312')

['3', '1', '2']

In [5]:
df = pd.DataFrame(data,list('321'),list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [8]:
df.sort_index(inplace=True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [12]:
df.sort_index(axis=1,inplace=True)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [13]:
df.sort_values(by='x',inplace=True)
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [17]:
df.sort_values(by = '1', axis = 1, inplace = True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9